# Taps
tap "axllent/apps"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "minio/stable"
tap "nicoverbruggen/cask"
tap "shivammathur/extensions"
tap "shivammathur/php"

# Packages
brew "bash"
brew "bat"
brew "php"
brew "composer"
brew "coreutils"
brew "dnsmasq"
brew "gh"
brew "git"
brew "go"
brew "grep"
brew "htop"
brew "mas"
brew "meilisearch", restart_service: true
brew "minio", restart_service: true
brew "nginx"
brew "node"
brew "pv"
brew "python"
brew "redis", restart_service: true
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "axllent/apps/mailpit"

# Casks
cask "dbngin"
cask "discord"
cask "docker"
cask "firefox-developer-edition"
cask "github"
cask "google-chrome"
cask "gpg-suite"
cask "imageoptim"
cask "iterm2"
cask "jetbrains-toolbox"
cask "krisp"
cask "microsoft-edge"
cask "ngrok"
cask "omnidisksweeper"
cask "phpmon"
cask "postman"
cask "raycast"
cask "spotify"
cask "tableplus"
cask "visual-studio-code"
cask "font-jetbrains-mono"
cask "font-jetbrainsmono-nerd-font"
cask "font-jetbrainsmono-nerd-font-mono"

# App store
mas "The Unarchiver", id: 425424353
